loadtest/results/k8s-soak.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/soak-load.js
        output: Prometheus remote write (http://localhost:9090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 30 max VUs, 6m10s max duration (incl. graceful stop):
              * mixed_traffic: Up to 30 looping VUs for 6m0s over 3 stages (gracefulRampDown: 10s, gracefulStop: 30s)


Run             [ 100% ] setup()
mixed_traffic   [   0% ]

Run             [ 100% ] setup()
mixed_traffic   [   0% ]

Run             [ 100% ] setup()
mixed_traffic   [   0% ]
time="2026-07-23T14:35:33-05:00" level=info msg="setup complete: productId=f0a6d554-173f-42d7-8431-420ace988f90, repeatCustomers=10" source=console

running (0m04.0s), 00/30 VUs, 0 complete and 0 interrupted iterations
mixed_traffic   [   0% ] 00/30 VUs  0m00.5s/6m00.0s

running (0m05.0s), 00/30 VUs, 0 complete and 0 interrupted iterations
mixed_traffic   [   0% ] 00/30 VUs  0m01.5s/6m00.0s

running (0m06.0s), 01/30 VUs, 0 complete and 0 interrupted iterations
mixed_traffic   [   1% ] 01/30 VUs  0m02.5s/6m00.0s

running (0m07.0s), 01/30 VUs, 3 complete and 0 interrupted iterations
mixed_traffic   [   1% ] 01/30 VUs  0m03.5s/6m00.0s

running (0m08.0s), 02/30 VUs, 4 complete and 0 interrupted iterations
mixed_traffic   [   1% ] 02/30 VUs  0m04.5s/6m00.0s

running (0m09.0s), 02/30 VUs, 7 complete and 0 interrupted iterations
mixed_traffic   [   2% ] 02/30 VUs  0m05.5s/6m00.0s

running (0m10.0s), 03/30 VUs, 11 complete and 0 interrupted iterations
mixed_traffic   [   2% ] 03/30 VUs  0m06.5s/6m00.0s

running (0m11.0s), 03/30 VUs, 12 complete and 0 interrupted iterations
mixed_traffic   [   2% ] 03/30 VUs  0m07.5s/6m00.0s

running (0m12.0s), 04/30 VUs, 15 complete and 0 interrupted iterations
mixed_traffic   [   2% ] 04/30 VUs  0m08.5s/6m00.0s

running (0m13.0s), 04/30 VUs, 22 complete and 0 interrupted iterations
mixed_traffic   [   3% ] 04/30 VUs  0m09.5s/6m00.0s

running (0m14.0s), 05/30 VUs, 29 complete and 0 interrupted iterations
mixed_traffic   [   3% ] 05/30 VUs  0m10.5s/6m00.0s

running (0m15.0s), 05/30 VUs, 33 complete and 0 interrupted iterations
mixed_traffic   [   3% ] 05/30 VUs  0m11.5s/6m00.0s

running (0m16.0s), 06/30 VUs, 39 complete and 0 interrupted iterations
mixed_traffic   [   3% ] 06/30 VUs  0m12.5s/6m00.0s

running (0m17.0s), 06/30 VUs, 44 complete and 0 interrupted iterations
mixed_traffic   [   4% ] 06/30 VUs  0m13.5s/6m00.0s

running (0m18.0s), 07/30 VUs, 53 complete and 0 interrupted iterations
mixed_traffic   [   4% ] 07/30 VUs  0m14.5s/6m00.0s

running (0m19.0s), 07/30 VUs, 62 complete and 0 interrupted iterations
mixed_traffic   [   4% ] 07/30 VUs  0m15.5s/6m00.0s

running (0m20.0s), 08/30 VUs, 70 complete and 0 interrupted iterations
mixed_traffic   [   5% ] 08/30 VUs  0m16.5s/6m00.0s

running (0m21.0s), 08/30 VUs, 76 complete and 0 interrupted iterations
mixed_traffic   [   5% ] 08/30 VUs  0m17.5s/6m00.0s

running (0m22.0s), 09/30 VUs, 79 complete and 0 interrupted iterations
mixed_traffic   [   5% ] 09/30 VUs  0m18.5s/6m00.0s

running (0m23.0s), 09/30 VUs, 92 complete and 0 interrupted iterations
mixed_traffic   [   5% ] 09/30 VUs  0m19.5s/6m00.0s

running (0m24.0s), 10/30 VUs, 98 complete and 0 interrupted iterations
mixed_traffic   [   6% ] 10/30 VUs  0m20.5s/6m00.0s

running (0m25.0s), 10/30 VUs, 101 complete and 0 interrupted iterations
mixed_traffic   [   6% ] 10/30 VUs  0m21.5s/6m00.0s

running (0m26.0s), 11/30 VUs, 107 complete and 0 interrupted iterations
mixed_traffic   [   6% ] 11/30 VUs  0m22.5s/6m00.0s

running (0m27.0s), 11/30 VUs, 116 complete and 0 interrupted iterations
mixed_traffic   [   7% ] 11/30 VUs  0m23.5s/6m00.0s

running (0m28.0s), 12/30 VUs, 131 complete and 0 interrupted iterations
mixed_traffic   [   7% ] 12/30 VUs  0m24.5s/6m00.0s

running (0m29.0s), 12/30 VUs, 139 complete and 0 interrupted iterations
mixed_traffic   [   7% ] 12/30 VUs  0m25.5s/6m00.0s

running (0m30.0s), 13/30 VUs, 139 complete and 0 interrupted iterations
mixed_traffic   [   7% ] 13/30 VUs  0m26.5s/6m00.0s

running (0m31.0s), 13/30 VUs, 143 complete and 0 interrupted iterations
mixed_traffic   [   8% ] 13/30 VUs  0m27.5s/6m00.0s

running (0m32.0s), 14/30 VUs, 161 complete and 0 interrupted iterations
mixed_traffic   [   8% ] 14/30 VUs  0m28.5s/6m00.0s

running (0m33.0s), 14/30 VUs, 177 complete and 0 interrupted iterations
mixed_traffic   [   8% ] 14/30 VUs  0m29.5s/6m00.0s

running (0m34.0s), 15/30 VUs, 190 complete and 0 interrupted iterations
mixed_traffic   [   8% ] 15/30 VUs  0m30.5s/6m00.0s

running (0m35.0s), 15/30 VUs, 206 complete and 0 interrupted iterations
mixed_traffic   [   9% ] 15/30 VUs  0m31.5s/6m00.0s

running (0m36.0s), 16/30 VUs, 223 complete and 0 interrupted iterations
mixed_traffic   [   9% ] 16/30 VUs  0m32.5s/6m00.0s

running (0m37.0s), 16/30 VUs, 237 complete and 0 interrupted iterations
mixed_traffic   [   9% ] 16/30 VUs  0m33.5s/6m00.0s

running (0m38.0s), 17/30 VUs, 244 complete and 0 interrupted iterations
mixed_traffic   [  10% ] 17/30 VUs  0m34.5s/6m00.0s

running (0m39.0s), 17/30 VUs, 250 complete and 0 interrupted iterations
mixed_traffic   [  10% ] 17/30 VUs  0m35.5s/6m00.0s

running (0m40.0s), 18/30 VUs, 260 complete and 0 interrupted iterations
mixed_traffic   [  10% ] 18/30 VUs  0m36.5s/6m00.0s

running (0m41.0s), 18/30 VUs, 268 complete and 0 interrupted iterations
mixed_traffic   [  10% ] 18/30 VUs  0m37.5s/6m00.0s

running (0m42.0s), 19/30 VUs, 278 complete and 0 interrupted iterations
mixed_traffic   [  11% ] 19/30 VUs  0m38.5s/6m00.0s

running (0m43.0s), 19/30 VUs, 291 complete and 0 interrupted iterations
mixed_traffic   [  11% ] 19/30 VUs  0m39.5s/6m00.0s

running (0m44.0s), 20/30 VUs, 302 complete and 0 interrupted iterations
mixed_traffic   [  11% ] 20/30 VUs  0m40.5s/6m00.0s

running (0m45.0s), 20/30 VUs, 310 complete and 0 interrupted iterations
mixed_traffic   [  12% ] 20/30 VUs  0m41.5s/6m00.0s

running (0m46.0s), 21/30 VUs, 325 complete and 0 interrupted iterations
mixed_traffic   [  12% ] 21/30 VUs  0m42.5s/6m00.0s

running (0m47.0s), 21/30 VUs, 348 complete and 0 interrupted iterations
mixed_traffic   [  12% ] 21/30 VUs  0m43.5s/6m00.0s

running (0m48.0s), 22/30 VUs, 381 complete and 0 interrupted iterations
mixed_traffic   [  12% ] 22/30 VUs  0m44.5s/6m00.0s

running (0m49.0s), 22/30 VUs, 424 complete and 0 interrupted iterations
mixed_traffic   [  13% ] 22/30 VUs  0m45.5s/6m00.0s

running (0m50.0s), 23/30 VUs, 472 complete and 0 interrupted iterations
mixed_traffic   [  13% ] 23/30 VUs  0m46.5s/6m00.0s

running (0m51.0s), 23/30 VUs, 521 complete and 0 interrupted iterations
mixed_traffic   [  13% ] 23/30 VUs  0m47.5s/6m00.0s

running (0m52.0s), 24/30 VUs, 570 complete and 0 interrupted iterations
mixed_traffic   [  13% ] 24/30 VUs  0m48.5s/6m00.0s

running (0m53.0s), 24/30 VUs, 621 complete and 0 interrupted iterations
mixed_traffic   [  14% ] 24/30 VUs  0m49.5s/6m00.0s

running (0m54.0s), 25/30 VUs, 673 complete and 0 interrupted iterations
mixed_traffic   [  14% ] 25/30 VUs  0m50.5s/6m00.0s

running (0m55.0s), 25/30 VUs, 728 complete and 0 interrupted iterations
mixed_traffic   [  14% ] 25/30 VUs  0m51.5s/6m00.0s

running (0m56.0s), 26/30 VUs, 776 complete and 0 interrupted iterations
mixed_traffic   [  15% ] 26/30 VUs  0m52.5s/6m00.0s

running (0m57.0s), 26/30 VUs, 820 complete and 0 interrupted iterations
mixed_traffic   [  15% ] 26/30 VUs  0m53.5s/6m00.0s

running (0m58.0s), 27/30 VUs, 861 complete and 0 interrupted iterations
mixed_traffic   [  15% ] 27/30 VUs  0m54.5s/6m00.0s

running (0m59.0s), 27/30 VUs, 893 complete and 0 interrupted iterations
mixed_traffic   [  15% ] 27/30 VUs  0m55.5s/6m00.0s

running (1m00.0s), 28/30 VUs, 909 complete and 0 interrupted iterations
mixed_traffic   [  16% ] 28/30 VUs  0m56.5s/6m00.0s

running (1m01.0s), 28/30 VUs, 924 complete and 0 interrupted iterations
mixed_traffic   [  16% ] 28/30 VUs  0m57.5s/6m00.0s

running (1m02.0s), 29/30 VUs, 938 complete and 0 interrupted iterations
mixed_traffic   [  16% ] 29/30 VUs  0m58.5s/6m00.0s

running (1m03.0s), 29/30 VUs, 959 complete and 0 interrupted iterations
mixed_traffic   [  17% ] 29/30 VUs  0m59.5s/6m00.0s

running (1m04.0s), 30/30 VUs, 986 complete and 0 interrupted iterations
mixed_traffic   [  17% ] 30/30 VUs  1m00.5s/6m00.0s

running (1m05.0s), 30/30 VUs, 1020 complete and 0 interrupted iterations
mixed_traffic   [  17% ] 30/30 VUs  1m01.5s/6m00.0s

running (1m06.0s), 30/30 VUs, 1061 complete and 0 interrupted iterations
mixed_traffic   [  17% ] 30/30 VUs  1m02.5s/6m00.0s

running (1m07.0s), 30/30 VUs, 1106 complete and 0 interrupted iterations
mixed_traffic   [  18% ] 30/30 VUs  1m03.5s/6m00.0s

running (1m08.0s), 30/30 VUs, 1149 complete and 0 interrupted iterations
mixed_traffic   [  18% ] 30/30 VUs  1m04.5s/6m00.0s

running (1m09.0s), 30/30 VUs, 1203 complete and 0 interrupted iterations
mixed_traffic   [  18% ] 30/30 VUs  1m05.5s/6m00.0s

running (1m10.0s), 30/30 VUs, 1265 complete and 0 interrupted iterations
mixed_traffic   [  18% ] 30/30 VUs  1m06.5s/6m00.0s

running (1m11.0s), 30/30 VUs, 1331 complete and 0 interrupted iterations
mixed_traffic   [  19% ] 30/30 VUs  1m07.5s/6m00.0s

running (1m12.0s), 30/30 VUs, 1390 complete and 0 interrupted iterations
mixed_traffic   [  19% ] 30/30 VUs  1m08.5s/6m00.0s

running (1m13.0s), 30/30 VUs, 1458 complete and 0 interrupted iterations
mixed_traffic   [  19% ] 30/30 VUs  1m09.5s/6m00.0s

running (1m14.0s), 30/30 VUs, 1508 complete and 0 interrupted iterations
mixed_traffic   [  20% ] 30/30 VUs  1m10.5s/6m00.0s

running (1m15.0s), 30/30 VUs, 1557 complete and 0 interrupted iterations
mixed_traffic   [  20% ] 30/30 VUs  1m11.5s/6m00.0s

running (1m16.0s), 30/30 VUs, 1590 complete and 0 interrupted iterations
mixed_traffic   [  20% ] 30/30 VUs  1m12.5s/6m00.0s

running (1m17.0s), 30/30 VUs, 1606 complete and 0 interrupted iterations
mixed_traffic   [  20% ] 30/30 VUs  1m13.5s/6m00.0s

running (1m18.0s), 30/30 VUs, 1620 complete and 0 interrupted iterations
mixed_traffic   [  21% ] 30/30 VUs  1m14.5s/6m00.0s

running (1m19.0s), 30/30 VUs, 1631 complete and 0 interrupted iterations
mixed_traffic   [  21% ] 30/30 VUs  1m15.5s/6m00.0s

running (1m20.0s), 30/30 VUs, 1656 complete and 0 interrupted iterations
mixed_traffic   [  21% ] 30/30 VUs  1m16.5s/6m00.0s

running (1m21.0s), 30/30 VUs, 1693 complete and 0 interrupted iterations
mixed_traffic   [  22% ] 30/30 VUs  1m17.5s/6m00.0s

running (1m22.0s), 30/30 VUs, 1734 complete and 0 interrupted iterations
mixed_traffic   [  22% ] 30/30 VUs  1m18.5s/6m00.0s

running (1m23.0s), 30/30 VUs, 1776 complete and 0 interrupted iterations
mixed_traffic   [  22% ] 30/30 VUs  1m19.5s/6m00.0s

running (1m24.0s), 30/30 VUs, 1823 complete and 0 interrupted iterations
mixed_traffic   [  22% ] 30/30 VUs  1m20.5s/6m00.0s

running (1m25.0s), 30/30 VUs, 1874 complete and 0 interrupted iterations
mixed_traffic   [  23% ] 30/30 VUs  1m21.5s/6m00.0s

running (1m26.0s), 30/30 VUs, 1933 complete and 0 interrupted iterations
mixed_traffic   [  23% ] 30/30 VUs  1m22.5s/6m00.0s

running (1m27.0s), 30/30 VUs, 1998 complete and 0 interrupted iterations
mixed_traffic   [  23% ] 30/30 VUs  1m23.5s/6m00.0s

running (1m28.0s), 30/30 VUs, 2062 complete and 0 interrupted iterations
mixed_traffic   [  23% ] 30/30 VUs  1m24.5s/6m00.0s

running (1m29.0s), 30/30 VUs, 2122 complete and 0 interrupted iterations
mixed_traffic   [  24% ] 30/30 VUs  1m25.5s/6m00.0s

running (1m30.0s), 30/30 VUs, 2175 complete and 0 interrupted iterations
mixed_traffic   [  24% ] 30/30 VUs  1m26.5s/6m00.0s

running (1m31.0s), 30/30 VUs, 2229 complete and 0 interrupted iterations
mixed_traffic   [  24% ] 30/30 VUs  1m27.5s/6m00.0s

running (1m32.0s), 30/30 VUs, 2258 complete and 0 interrupted iterations
mixed_traffic   [  25% ] 30/30 VUs  1m28.5s/6m00.0s

running (1m33.0s), 30/30 VUs, 2263 complete and 0 interrupted iterations
mixed_traffic   [  25% ] 30/30 VUs  1m29.5s/6m00.0s

running (1m34.0s), 30/30 VUs, 2268 complete and 0 interrupted iterations
mixed_traffic   [  25% ] 30/30 VUs  1m30.5s/6m00.0s

running (1m35.0s), 30/30 VUs, 2291 complete and 0 interrupted iterations
mixed_traffic   [  25% ] 30/30 VUs  1m31.5s/6m00.0s

running (1m36.0s), 30/30 VUs, 2328 complete and 0 interrupted iterations
mixed_traffic   [  26% ] 30/30 VUs  1m32.5s/6m00.0s

running (1m37.0s), 30/30 VUs, 2367 complete and 0 interrupted iterations
mixed_traffic   [  26% ] 30/30 VUs  1m33.5s/6m00.0s

running (1m38.0s), 30/30 VUs, 2405 complete and 0 interrupted iterations
mixed_traffic   [  26% ] 30/30 VUs  1m34.5s/6m00.0s

running (1m39.0s), 30/30 VUs, 2447 complete and 0 interrupted iterations
mixed_traffic   [  27% ] 30/30 VUs  1m35.5s/6m00.0s

running (1m40.0s), 30/30 VUs, 2486 complete and 0 interrupted iterations
mixed_traffic   [  27% ] 30/30 VUs  1m36.5s/6m00.0s

running (1m41.0s), 30/30 VUs, 2538 complete and 0 interrupted iterations
mixed_traffic   [  27% ] 30/30 VUs  1m37.5s/6m00.0s

running (1m42.0s), 30/30 VUs, 2596 complete and 0 interrupted iterations
mixed_traffic   [  27% ] 30/30 VUs  1m38.5s/6m00.0s

running (1m43.0s), 30/30 VUs, 2658 complete and 0 interrupted iterations
mixed_traffic   [  28% ] 30/30 VUs  1m39.5s/6m00.0s

running (1m44.0s), 30/30 VUs, 2728 complete and 0 interrupted iterations
mixed_traffic   [  28% ] 30/30 VUs  1m40.5s/6m00.0s

running (1m45.0s), 30/30 VUs, 2789 complete and 0 interrupted iterations
mixed_traffic   [  28% ] 30/30 VUs  1m41.5s/6m00.0s

running (1m46.0s), 30/30 VUs, 2853 complete and 0 interrupted iterations
mixed_traffic   [  28% ] 30/30 VUs  1m42.5s/6m00.0s

running (1m47.0s), 30/30 VUs, 2907 complete and 0 interrupted iterations
mixed_traffic   [  29% ] 30/30 VUs  1m43.5s/6m00.0s

running (1m48.0s), 30/30 VUs, 2942 complete and 0 interrupted iterations
mixed_traffic   [  29% ] 30/30 VUs  1m44.5s/6m00.0s

running (1m49.0s), 30/30 VUs, 2963 complete and 0 interrupted iterations
mixed_traffic   [  29% ] 30/30 VUs  1m45.5s/6m00.0s

running (1m50.0s), 30/30 VUs, 2975 complete and 0 interrupted iterations
mixed_traffic   [  30% ] 30/30 VUs  1m46.5s/6m00.0s

running (1m51.0s), 30/30 VUs, 2996 complete and 0 interrupted iterations
mixed_traffic   [  30% ] 30/30 VUs  1m47.5s/6m00.0s

running (1m52.0s), 30/30 VUs, 3022 complete and 0 interrupted iterations
mixed_traffic   [  30% ] 30/30 VUs  1m48.5s/6m00.0s

running (1m53.0s), 30/30 VUs, 3057 complete and 0 interrupted iterations
mixed_traffic   [  30% ] 30/30 VUs  1m49.5s/6m00.0s

running (1m54.0s), 30/30 VUs, 3099 complete and 0 interrupted iterations
mixed_traffic   [  31% ] 30/30 VUs  1m50.5s/6m00.0s

running (1m55.0s), 30/30 VUs, 3147 complete and 0 interrupted iterations
mixed_traffic   [  31% ] 30/30 VUs  1m51.5s/6m00.0s

running (1m56.0s), 30/30 VUs, 3195 complete and 0 interrupted iterations
mixed_traffic   [  31% ] 30/30 VUs  1m52.5s/6m00.0s

running (1m57.0s), 30/30 VUs, 3236 complete and 0 interrupted iterations
mixed_traffic   [  32% ] 30/30 VUs  1m53.5s/6m00.0s

running (1m58.0s), 30/30 VUs, 3295 complete and 0 interrupted iterations
mixed_traffic   [  32% ] 30/30 VUs  1m54.5s/6m00.0s

running (1m59.0s), 30/30 VUs, 3356 complete and 0 interrupted iterations
mixed_traffic   [  32% ] 30/30 VUs  1m55.5s/6m00.0s

running (2m00.0s), 30/30 VUs, 3422 complete and 0 interrupted iterations
mixed_traffic   [  32% ] 30/30 VUs  1m56.5s/6m00.0s

running (2m01.0s), 30/30 VUs, 3482 complete and 0 interrupted iterations
mixed_traffic   [  33% ] 30/30 VUs  1m57.5s/6m00.0s

running (2m02.0s), 30/30 VUs, 3542 complete and 0 interrupted iterations
mixed_traffic   [  33% ] 30/30 VUs  1m58.5s/6m00.0s

running (2m03.0s), 30/30 VUs, 3591 complete and 0 interrupted iterations
mixed_traffic   [  33% ] 30/30 VUs  1m59.5s/6m00.0s

running (2m04.0s), 30/30 VUs, 3638 complete and 0 interrupted iterations
mixed_traffic   [  33% ] 30/30 VUs  2m00.5s/6m00.0s

running (2m05.0s), 30/30 VUs, 3661 complete and 0 interrupted iterations
mixed_traffic   [  34% ] 30/30 VUs  2m01.5s/6m00.0s

running (2m06.0s), 30/30 VUs, 3673 complete and 0 interrupted iterations
mixed_traffic   [  34% ] 30/30 VUs  2m02.5s/6m00.0s

running (2m07.0s), 30/30 VUs, 3684 complete and 0 interrupted iterations
mixed_traffic   [  34% ] 30/30 VUs  2m03.5s/6m00.0s

running (2m08.0s), 30/30 VUs, 3718 complete and 0 interrupted iterations
mixed_traffic   [  35% ] 30/30 VUs  2m04.5s/6m00.0s

running (2m09.0s), 30/30 VUs, 3756 complete and 0 interrupted iterations
mixed_traffic   [  35% ] 30/30 VUs  2m05.5s/6m00.0s

running (2m10.0s), 30/30 VUs, 3796 complete and 0 interrupted iterations
mixed_traffic   [  35% ] 30/30 VUs  2m06.5s/6m00.0s

running (2m11.0s), 30/30 VUs, 3837 complete and 0 interrupted iterations
mixed_traffic   [  35% ] 30/30 VUs  2m07.5s/6m00.0s

running (2m12.0s), 30/30 VUs, 3878 complete and 0 interrupted iterations
mixed_traffic   [  36% ] 30/30 VUs  2m08.5s/6m00.0s

running (2m13.0s), 30/30 VUs, 3935 complete and 0 interrupted iterations
mixed_traffic   [  36% ] 30/30 VUs  2m09.5s/6m00.0s

running (2m14.0s), 30/30 VUs, 3997 complete and 0 interrupted iterations
mixed_traffic   [  36% ] 30/30 VUs  2m10.5s/6m00.0s

running (2m15.0s), 30/30 VUs, 4059 complete and 0 interrupted iterations
mixed_traffic   [  37% ] 30/30 VUs  2m11.5s/6m00.0s

running (2m16.0s), 30/30 VUs, 4126 complete and 0 interrupted iterations
mixed_traffic   [  37% ] 30/30 VUs  2m12.5s/6m00.0s

running (2m17.0s), 30/30 VUs, 4187 complete and 0 interrupted iterations
mixed_traffic   [  37% ] 30/30 VUs  2m13.5s/6m00.0s

running (2m18.0s), 30/30 VUs, 4244 complete and 0 interrupted iterations
mixed_traffic   [  37% ] 30/30 VUs  2m14.5s/6m00.0s

running (2m19.0s), 30/30 VUs, 4291 complete and 0 interrupted iterations
mixed_traffic   [  38% ] 30/30 VUs  2m15.5s/6m00.0s

running (2m20.0s), 30/30 VUs, 4324 complete and 0 interrupted iterations
mixed_traffic   [  38% ] 30/30 VUs  2m16.5s/6m00.0s

running (2m21.0s), 30/30 VUs, 4348 complete and 0 interrupted iterations
mixed_traffic   [  38% ] 30/30 VUs  2m17.5s/6m00.0s

running (2m22.0s), 30/30 VUs, 4368 complete and 0 interrupted iterations
mixed_traffic   [  38% ] 30/30 VUs  2m18.5s/6m00.0s

running (2m23.0s), 30/30 VUs, 4394 complete and 0 interrupted iterations
mixed_traffic   [  39% ] 30/30 VUs  2m19.5s/6m00.0s

running (2m24.0s), 30/30 VUs, 4431 complete and 0 interrupted iterations
mixed_traffic   [  39% ] 30/30 VUs  2m20.5s/6m00.0s

running (2m25.0s), 30/30 VUs, 4475 complete and 0 interrupted iterations
mixed_traffic   [  39% ] 30/30 VUs  2m21.5s/6m00.0s

running (2m26.0s), 30/30 VUs, 4523 complete and 0 interrupted iterations
mixed_traffic   [  40% ] 30/30 VUs  2m22.5s/6m00.0s

running (2m27.0s), 30/30 VUs, 4578 complete and 0 interrupted iterations
mixed_traffic   [  40% ] 30/30 VUs  2m23.5s/6m00.0s

running (2m28.0s), 30/30 VUs, 4633 complete and 0 interrupted iterations
mixed_traffic   [  40% ] 30/30 VUs  2m24.5s/6m00.0s

running (2m29.0s), 30/30 VUs, 4696 complete and 0 interrupted iterations
mixed_traffic   [  40% ] 30/30 VUs  2m25.5s/6m00.0s

running (2m30.0s), 30/30 VUs, 4764 complete and 0 interrupted iterations
mixed_traffic   [  41% ] 30/30 VUs  2m26.5s/6m00.0s

running (2m31.0s), 30/30 VUs, 4826 complete and 0 interrupted iterations
mixed_traffic   [  41% ] 30/30 VUs  2m27.5s/6m00.0s

running (2m32.0s), 30/30 VUs, 4889 complete and 0 interrupted iterations
mixed_traffic   [  41% ] 30/30 VUs  2m28.5s/6m00.0s

running (2m33.0s), 30/30 VUs, 4951 complete and 0 interrupted iterations
mixed_traffic   [  42% ] 30/30 VUs  2m29.5s/6m00.0s

running (2m34.0s), 30/30 VUs, 4998 complete and 0 interrupted iterations
mixed_traffic   [  42% ] 30/30 VUs  2m30.5s/6m00.0s

running (2m35.0s), 30/30 VUs, 5053 complete and 0 interrupted iterations
mixed_traffic   [  42% ] 30/30 VUs  2m31.5s/6m00.0s

running (2m36.0s), 30/30 VUs, 5079 complete and 0 interrupted iterations
mixed_traffic   [  42% ] 30/30 VUs  2m32.5s/6m00.0s

running (2m37.0s), 30/30 VUs, 5092 complete and 0 interrupted iterations
mixed_traffic   [  43% ] 30/30 VUs  2m33.5s/6m00.0s

running (2m38.0s), 30/30 VUs, 5104 complete and 0 interrupted iterations
mixed_traffic   [  43% ] 30/30 VUs  2m34.5s/6m00.0s

running (2m39.0s), 30/30 VUs, 5117 complete and 0 interrupted iterations
mixed_traffic   [  43% ] 30/30 VUs  2m35.5s/6m00.0s

running (2m40.0s), 30/30 VUs, 5141 complete and 0 interrupted iterations
mixed_traffic   [  43% ] 30/30 VUs  2m36.5s/6m00.0s

running (2m41.0s), 30/30 VUs, 5174 complete and 0 interrupted iterations
mixed_traffic   [  44% ] 30/30 VUs  2m37.5s/6m00.0s

running (2m42.0s), 30/30 VUs, 5213 complete and 0 interrupted iterations
mixed_traffic   [  44% ] 30/30 VUs  2m38.5s/6m00.0s

running (2m43.0s), 30/30 VUs, 5249 complete and 0 interrupted iterations
mixed_traffic   [  44% ] 30/30 VUs  2m39.5s/6m00.0s

running (2m44.0s), 30/30 VUs, 5292 complete and 0 interrupted iterations
mixed_traffic   [  45% ] 30/30 VUs  2m40.5s/6m00.0s

running (2m45.0s), 30/30 VUs, 5333 complete and 0 interrupted iterations
mixed_traffic   [  45% ] 30/30 VUs  2m41.5s/6m00.0s

running (2m46.0s), 30/30 VUs, 5375 complete and 0 interrupted iterations
mixed_traffic   [  45% ] 30/30 VUs  2m42.5s/6m00.0s

running (2m47.0s), 30/30 VUs, 5433 complete and 0 interrupted iterations
mixed_traffic   [  45% ] 30/30 VUs  2m43.5s/6m00.0s

running (2m48.0s), 30/30 VUs, 5498 complete and 0 interrupted iterations
mixed_traffic   [  46% ] 30/30 VUs  2m44.5s/6m00.0s

running (2m49.0s), 30/30 VUs, 5560 complete and 0 interrupted iterations
mixed_traffic   [  46% ] 30/30 VUs  2m45.5s/6m00.0s

running (2m50.0s), 30/30 VUs, 5616 complete and 0 interrupted iterations
mixed_traffic   [  46% ] 30/30 VUs  2m46.5s/6m00.0s

running (2m51.0s), 30/30 VUs, 5666 complete and 0 interrupted iterations
mixed_traffic   [  47% ] 30/30 VUs  2m47.5s/6m00.0s

running (2m52.0s), 30/30 VUs, 5705 complete and 0 interrupted iterations
mixed_traffic   [  47% ] 30/30 VUs  2m48.5s/6m00.0s

running (2m53.0s), 30/30 VUs, 5724 complete and 0 interrupted iterations
mixed_traffic   [  47% ] 30/30 VUs  2m49.5s/6m00.0s

running (2m54.0s), 30/30 VUs, 5734 complete and 0 interrupted iterations
mixed_traffic   [  47% ] 30/30 VUs  2m50.5s/6m00.0s

running (2m55.0s), 30/30 VUs, 5752 complete and 0 interrupted iterations
mixed_traffic   [  48% ] 30/30 VUs  2m51.5s/6m00.0s

running (2m56.0s), 30/30 VUs, 5776 complete and 0 interrupted iterations
mixed_traffic   [  48% ] 30/30 VUs  2m52.5s/6m00.0s

running (2m57.0s), 30/30 VUs, 5809 complete and 0 interrupted iterations
mixed_traffic   [  48% ] 30/30 VUs  2m53.5s/6m00.0s

running (2m58.0s), 30/30 VUs, 5849 complete and 0 interrupted iterations
mixed_traffic   [  48% ] 30/30 VUs  2m54.5s/6m00.0s

running (2m59.0s), 30/30 VUs, 5888 complete and 0 interrupted iterations
mixed_traffic   [  49% ] 30/30 VUs  2m55.5s/6m00.0s

running (3m00.0s), 30/30 VUs, 5930 complete and 0 interrupted iterations
mixed_traffic   [  49% ] 30/30 VUs  2m56.5s/6m00.0s

running (3m01.0s), 30/30 VUs, 5976 complete and 0 interrupted iterations
mixed_traffic   [  49% ] 30/30 VUs  2m57.5s/6m00.0s

running (3m02.0s), 30/30 VUs, 6024 complete and 0 interrupted iterations
mixed_traffic   [  50% ] 30/30 VUs  2m58.5s/6m00.0s

running (3m03.0s), 30/30 VUs, 6090 complete and 0 interrupted iterations
mixed_traffic   [  50% ] 30/30 VUs  2m59.5s/6m00.0s

running (3m04.0s), 30/30 VUs, 6154 complete and 0 interrupted iterations
mixed_traffic   [  50% ] 30/30 VUs  3m00.5s/6m00.0s

running (3m05.0s), 30/30 VUs, 6215 complete and 0 interrupted iterations
mixed_traffic   [  50% ] 30/30 VUs  3m01.5s/6m00.0s

running (3m06.0s), 30/30 VUs, 6274 complete and 0 interrupted iterations
mixed_traffic   [  51% ] 30/30 VUs  3m02.5s/6m00.0s

running (3m07.0s), 30/30 VUs, 6328 complete and 0 interrupted iterations
mixed_traffic   [  51% ] 30/30 VUs  3m03.5s/6m00.0s

running (3m08.0s), 30/30 VUs, 6359 complete and 0 interrupted iterations
mixed_traffic   [  51% ] 30/30 VUs  3m04.5s/6m00.0s

running (3m09.0s), 30/30 VUs, 6380 complete and 0 interrupted iterations
mixed_traffic   [  52% ] 30/30 VUs  3m05.5s/6m00.0s

running (3m10.0s), 30/30 VUs, 6395 complete and 0 interrupted iterations
mixed_traffic   [  52% ] 30/30 VUs  3m06.5s/6m00.0s

running (3m11.0s), 30/30 VUs, 6419 complete and 0 interrupted iterations
mixed_traffic   [  52% ] 30/30 VUs  3m07.5s/6m00.0s

running (3m12.0s), 30/30 VUs, 6451 complete and 0 interrupted iterations
mixed_traffic   [  52% ] 30/30 VUs  3m08.5s/6m00.0s

running (3m13.0s), 30/30 VUs, 6488 complete and 0 interrupted iterations
mixed_traffic   [  53% ] 30/30 VUs  3m09.5s/6m00.0s

running (3m14.0s), 30/30 VUs, 6541 complete and 0 interrupted iterations
mixed_traffic   [  53% ] 30/30 VUs  3m10.5s/6m00.0s

running (3m15.0s), 30/30 VUs, 6610 complete and 0 interrupted iterations
mixed_traffic   [  53% ] 30/30 VUs  3m11.5s/6m00.0s

running (3m16.0s), 30/30 VUs, 6684 complete and 0 interrupted iterations
mixed_traffic   [  53% ] 30/30 VUs  3m12.5s/6m00.0s

running (3m17.0s), 30/30 VUs, 6750 complete and 0 interrupted iterations
mixed_traffic   [  54% ] 30/30 VUs  3m13.5s/6m00.0s

running (3m18.0s), 30/30 VUs, 6814 complete and 0 interrupted iterations
mixed_traffic   [  54% ] 30/30 VUs  3m14.5s/6m00.0s

running (3m19.0s), 30/30 VUs, 6883 complete and 0 interrupted iterations
mixed_traffic   [  54% ] 30/30 VUs  3m15.5s/6m00.0s

running (3m20.0s), 30/30 VUs, 6942 complete and 0 interrupted iterations
mixed_traffic   [  55% ] 30/30 VUs  3m16.5s/6m00.0s

running (3m21.0s), 30/30 VUs, 6996 complete and 0 interrupted iterations
mixed_traffic   [  55% ] 30/30 VUs  3m17.5s/6m00.0s

running (3m22.0s), 30/30 VUs, 7046 complete and 0 interrupted iterations
mixed_traffic   [  55% ] 30/30 VUs  3m18.5s/6m00.0s

running (3m23.0s), 30/30 VUs, 7088 complete and 0 interrupted iterations
mixed_traffic   [  55% ] 30/30 VUs  3m19.5s/6m00.0s

running (3m24.0s), 30/30 VUs, 7138 complete and 0 interrupted iterations
mixed_traffic   [  56% ] 30/30 VUs  3m20.5s/6m00.0s

running (3m25.0s), 30/30 VUs, 7179 complete and 0 interrupted iterations
mixed_traffic   [  56% ] 30/30 VUs  3m21.5s/6m00.0s

running (3m26.0s), 30/30 VUs, 7223 complete and 0 interrupted iterations
mixed_traffic   [  56% ] 30/30 VUs  3m22.5s/6m00.0s

running (3m27.0s), 30/30 VUs, 7263 complete and 0 interrupted iterations
mixed_traffic   [  57% ] 30/30 VUs  3m23.5s/6m00.0s

running (3m28.0s), 30/30 VUs, 7300 complete and 0 interrupted iterations
mixed_traffic   [  57% ] 30/30 VUs  3m24.5s/6m00.0s

running (3m29.0s), 30/30 VUs, 7339 complete and 0 interrupted iterations
mixed_traffic   [  57% ] 30/30 VUs  3m25.5s/6m00.0s

running (3m30.0s), 30/30 VUs, 7381 complete and 0 interrupted iterations
mixed_traffic   [  57% ] 30/30 VUs  3m26.5s/6m00.0s

running (3m31.0s), 30/30 VUs, 7425 complete and 0 interrupted iterations
mixed_traffic   [  58% ] 30/30 VUs  3m27.5s/6m00.0s

running (3m32.0s), 30/30 VUs, 7483 complete and 0 interrupted iterations
mixed_traffic   [  58% ] 30/30 VUs  3m28.5s/6m00.0s

running (3m33.0s), 30/30 VUs, 7543 complete and 0 interrupted iterations
mixed_traffic   [  58% ] 30/30 VUs  3m29.5s/6m00.0s

running (3m34.0s), 30/30 VUs, 7602 complete and 0 interrupted iterations
mixed_traffic   [  58% ] 30/30 VUs  3m30.5s/6m00.0s

running (3m35.0s), 30/30 VUs, 7652 complete and 0 interrupted iterations
mixed_traffic   [  59% ] 30/30 VUs  3m31.5s/6m00.0s

running (3m36.0s), 30/30 VUs, 7705 complete and 0 interrupted iterations
mixed_traffic   [  59% ] 30/30 VUs  3m32.5s/6m00.0s

running (3m37.0s), 30/30 VUs, 7730 complete and 0 interrupted iterations
mixed_traffic   [  59% ] 30/30 VUs  3m33.5s/6m00.0s

running (3m38.0s), 30/30 VUs, 7745 complete and 0 interrupted iterations
mixed_traffic   [  60% ] 30/30 VUs  3m34.5s/6m00.0s

running (3m39.0s), 30/30 VUs, 7755 complete and 0 interrupted iterations
mixed_traffic   [  60% ] 30/30 VUs  3m35.5s/6m00.0s

running (3m40.0s), 30/30 VUs, 7773 complete and 0 interrupted iterations
mixed_traffic   [  60% ] 30/30 VUs  3m36.5s/6m00.0s

running (3m41.0s), 30/30 VUs, 7811 complete and 0 interrupted iterations
mixed_traffic   [  60% ] 30/30 VUs  3m37.5s/6m00.0s

running (3m42.0s), 30/30 VUs, 7848 complete and 0 interrupted iterations
mixed_traffic   [  61% ] 30/30 VUs  3m38.5s/6m00.0s

running (3m43.0s), 30/30 VUs, 7889 complete and 0 interrupted iterations
mixed_traffic   [  61% ] 30/30 VUs  3m39.5s/6m00.0s

running (3m44.0s), 30/30 VUs, 7928 complete and 0 interrupted iterations
mixed_traffic   [  61% ] 30/30 VUs  3m40.5s/6m00.0s

running (3m45.0s), 30/30 VUs, 7972 complete and 0 interrupted iterations
mixed_traffic   [  62% ] 30/30 VUs  3m41.5s/6m00.0s

running (3m46.0s), 30/30 VUs, 8023 complete and 0 interrupted iterations
mixed_traffic   [  62% ] 30/30 VUs  3m42.5s/6m00.0s

running (3m47.0s), 30/30 VUs, 8080 complete and 0 interrupted iterations
mixed_traffic   [  62% ] 30/30 VUs  3m43.5s/6m00.0s

running (3m48.0s), 30/30 VUs, 8140 complete and 0 interrupted iterations
mixed_traffic   [  62% ] 30/30 VUs  3m44.5s/6m00.0s

running (3m49.0s), 30/30 VUs, 8201 complete and 0 interrupted iterations
mixed_traffic   [  63% ] 30/30 VUs  3m45.5s/6m00.0s

running (3m50.0s), 30/30 VUs, 8256 complete and 0 interrupted iterations
mixed_traffic   [  63% ] 30/30 VUs  3m46.5s/6m00.0s

running (3m51.0s), 30/30 VUs, 8310 complete and 0 interrupted iterations
mixed_traffic   [  63% ] 30/30 VUs  3m47.5s/6m00.0s

running (3m52.0s), 30/30 VUs, 8352 complete and 0 interrupted iterations
mixed_traffic   [  63% ] 30/30 VUs  3m48.5s/6m00.0s

running (3m53.0s), 30/30 VUs, 8367 complete and 0 interrupted iterations
mixed_traffic   [  64% ] 30/30 VUs  3m49.5s/6m00.0s

running (3m54.0s), 30/30 VUs, 8378 complete and 0 interrupted iterations
mixed_traffic   [  64% ] 30/30 VUs  3m50.5s/6m00.0s

running (3m55.0s), 30/30 VUs, 8400 complete and 0 interrupted iterations
mixed_traffic   [  64% ] 30/30 VUs  3m51.5s/6m00.0s

running (3m56.0s), 30/30 VUs, 8425 complete and 0 interrupted iterations
mixed_traffic   [  65% ] 30/30 VUs  3m52.5s/6m00.0s

running (3m57.0s), 30/30 VUs, 8460 complete and 0 interrupted iterations
mixed_traffic   [  65% ] 30/30 VUs  3m53.5s/6m00.0s

running (3m58.0s), 30/30 VUs, 8492 complete and 0 interrupted iterations
mixed_traffic   [  65% ] 30/30 VUs  3m54.5s/6m00.0s

running (3m59.0s), 30/30 VUs, 8531 complete and 0 interrupted iterations
mixed_traffic   [  65% ] 30/30 VUs  3m55.5s/6m00.0s

running (4m00.0s), 30/30 VUs, 8579 complete and 0 interrupted iterations
mixed_traffic   [  66% ] 30/30 VUs  3m56.5s/6m00.0s

running (4m01.0s), 30/30 VUs, 8622 complete and 0 interrupted iterations
mixed_traffic   [  66% ] 30/30 VUs  3m57.5s/6m00.0s

running (4m02.0s), 30/30 VUs, 8669 complete and 0 interrupted iterations
mixed_traffic   [  66% ] 30/30 VUs  3m58.5s/6m00.0s

running (4m03.0s), 30/30 VUs, 8728 complete and 0 interrupted iterations
mixed_traffic   [  67% ] 30/30 VUs  3m59.5s/6m00.0s

running (4m04.0s), 30/30 VUs, 8790 complete and 0 interrupted iterations
mixed_traffic   [  67% ] 30/30 VUs  4m00.5s/6m00.0s

running (4m05.0s), 30/30 VUs, 8859 complete and 0 interrupted iterations
mixed_traffic   [  67% ] 30/30 VUs  4m01.5s/6m00.0s

running (4m06.0s), 30/30 VUs, 8919 complete and 0 interrupted iterations
mixed_traffic   [  67% ] 30/30 VUs  4m02.5s/6m00.0s

running (4m07.0s), 30/30 VUs, 8965 complete and 0 interrupted iterations
mixed_traffic   [  68% ] 30/30 VUs  4m03.5s/6m00.0s

running (4m08.0s), 30/30 VUs, 8993 complete and 0 interrupted iterations
mixed_traffic   [  68% ] 30/30 VUs  4m04.5s/6m00.0s

running (4m09.0s), 30/30 VUs, 9006 complete and 0 interrupted iterations
mixed_traffic   [  68% ] 30/30 VUs  4m05.5s/6m00.0s

running (4m10.0s), 30/30 VUs, 9019 complete and 0 interrupted iterations
mixed_traffic   [  68% ] 30/30 VUs  4m06.5s/6m00.0s

running (4m11.0s), 30/30 VUs, 9041 complete and 0 interrupted iterations
mixed_traffic   [  69% ] 30/30 VUs  4m07.5s/6m00.0s

running (4m12.0s), 30/30 VUs, 9075 complete and 0 interrupted iterations
mixed_traffic   [  69% ] 30/30 VUs  4m08.5s/6m00.0s

running (4m13.0s), 30/30 VUs, 9118 complete and 0 interrupted iterations
mixed_traffic   [  69% ] 30/30 VUs  4m09.5s/6m00.0s

running (4m14.0s), 30/30 VUs, 9164 complete and 0 interrupted iterations
mixed_traffic   [  70% ] 30/30 VUs  4m10.5s/6m00.0s

running (4m15.0s), 30/30 VUs, 9218 complete and 0 interrupted iterations
mixed_traffic   [  70% ] 30/30 VUs  4m11.5s/6m00.0s

running (4m16.0s), 30/30 VUs, 9286 complete and 0 interrupted iterations
mixed_traffic   [  70% ] 30/30 VUs  4m12.5s/6m00.0s

running (4m17.0s), 30/30 VUs, 9350 complete and 0 interrupted iterations
mixed_traffic   [  70% ] 30/30 VUs  4m13.5s/6m00.0s

running (4m18.0s), 30/30 VUs, 9416 complete and 0 interrupted iterations
mixed_traffic   [  71% ] 30/30 VUs  4m14.5s/6m00.0s

running (4m19.0s), 30/30 VUs, 9481 complete and 0 interrupted iterations
mixed_traffic   [  71% ] 30/30 VUs  4m15.5s/6m00.0s

running (4m20.0s), 30/30 VUs, 9548 complete and 0 interrupted iterations
mixed_traffic   [  71% ] 30/30 VUs  4m16.5s/6m00.0s

running (4m21.0s), 30/30 VUs, 9606 complete and 0 interrupted iterations
mixed_traffic   [  72% ] 30/30 VUs  4m17.5s/6m00.0s

running (4m22.0s), 30/30 VUs, 9661 complete and 0 interrupted iterations
mixed_traffic   [  72% ] 30/30 VUs  4m18.5s/6m00.0s

running (4m23.0s), 30/30 VUs, 9715 complete and 0 interrupted iterations
mixed_traffic   [  72% ] 30/30 VUs  4m19.5s/6m00.0s

running (4m24.0s), 30/30 VUs, 9766 complete and 0 interrupted iterations
mixed_traffic   [  72% ] 30/30 VUs  4m20.5s/6m00.0s

running (4m25.0s), 30/30 VUs, 9821 complete and 0 interrupted iterations
mixed_traffic   [  73% ] 30/30 VUs  4m21.5s/6m00.0s

running (4m26.0s), 30/30 VUs, 9868 complete and 0 interrupted iterations
mixed_traffic   [  73% ] 30/30 VUs  4m22.5s/6m00.0s

running (4m27.0s), 30/30 VUs, 9917 complete and 0 interrupted iterations
mixed_traffic   [  73% ] 30/30 VUs  4m23.5s/6m00.0s

running (4m28.0s), 30/30 VUs, 9963 complete and 0 interrupted iterations
mixed_traffic   [  73% ] 30/30 VUs  4m24.5s/6m00.0s

running (4m29.0s), 30/30 VUs, 10012 complete and 0 interrupted iterations
mixed_traffic   [  74% ] 30/30 VUs  4m25.5s/6m00.0s

running (4m30.0s), 30/30 VUs, 10065 complete and 0 interrupted iterations
mixed_traffic   [  74% ] 30/30 VUs  4m26.5s/6m00.0s

running (4m31.0s), 30/30 VUs, 10116 complete and 0 interrupted iterations
mixed_traffic   [  74% ] 30/30 VUs  4m27.5s/6m00.0s

running (4m32.0s), 30/30 VUs, 10183 complete and 0 interrupted iterations
mixed_traffic   [  75% ] 30/30 VUs  4m28.5s/6m00.0s

running (4m33.0s), 30/30 VUs, 10250 complete and 0 interrupted iterations
mixed_traffic   [  75% ] 30/30 VUs  4m29.5s/6m00.0s

running (4m34.0s), 30/30 VUs, 10307 complete and 0 interrupted iterations
mixed_traffic   [  75% ] 30/30 VUs  4m30.5s/6m00.0s

running (4m35.0s), 30/30 VUs, 10354 complete and 0 interrupted iterations
mixed_traffic   [  75% ] 30/30 VUs  4m31.5s/6m00.0s

running (4m36.0s), 30/30 VUs, 10404 complete and 0 interrupted iterations
mixed_traffic   [  76% ] 30/30 VUs  4m32.5s/6m00.0s

running (4m37.0s), 30/30 VUs, 10436 complete and 0 interrupted iterations
mixed_traffic   [  76% ] 30/30 VUs  4m33.5s/6m00.0s

running (4m38.0s), 30/30 VUs, 10458 complete and 0 interrupted iterations
mixed_traffic   [  76% ] 30/30 VUs  4m34.5s/6m00.0s

running (4m39.0s), 30/30 VUs, 10469 complete and 0 interrupted iterations
mixed_traffic   [  77% ] 30/30 VUs  4m35.5s/6m00.0s

running (4m40.0s), 30/30 VUs, 10480 complete and 0 interrupted iterations
mixed_traffic   [  77% ] 30/30 VUs  4m36.5s/6m00.0s

running (4m41.0s), 30/30 VUs, 10498 complete and 0 interrupted iterations
mixed_traffic   [  77% ] 30/30 VUs  4m37.5s/6m00.0s

running (4m42.0s), 30/30 VUs, 10529 complete and 0 interrupted iterations
mixed_traffic   [  77% ] 30/30 VUs  4m38.5s/6m00.0s

running (4m43.0s), 30/30 VUs, 10567 complete and 0 interrupted iterations
mixed_traffic   [  78% ] 30/30 VUs  4m39.5s/6m00.0s

running (4m44.0s), 30/30 VUs, 10614 complete and 0 interrupted iterations
mixed_traffic   [  78% ] 30/30 VUs  4m40.5s/6m00.0s

running (4m45.0s), 30/30 VUs, 10651 complete and 0 interrupted iterations
mixed_traffic   [  78% ] 30/30 VUs  4m41.5s/6m00.0s

running (4m46.0s), 30/30 VUs, 10692 complete and 0 interrupted iterations
mixed_traffic   [  78% ] 30/30 VUs  4m42.5s/6m00.0s

running (4m47.0s), 30/30 VUs, 10736 complete and 0 interrupted iterations
mixed_traffic   [  79% ] 30/30 VUs  4m43.5s/6m00.0s

running (4m48.0s), 30/30 VUs, 10787 complete and 0 interrupted iterations
mixed_traffic   [  79% ] 30/30 VUs  4m44.5s/6m00.0s

running (4m49.0s), 30/30 VUs, 10849 complete and 0 interrupted iterations
mixed_traffic   [  79% ] 30/30 VUs  4m45.5s/6m00.0s

running (4m50.0s), 30/30 VUs, 10911 complete and 0 interrupted iterations
mixed_traffic   [  80% ] 30/30 VUs  4m46.5s/6m00.0s

running (4m51.0s), 30/30 VUs, 10969 complete and 0 interrupted iterations
mixed_traffic   [  80% ] 30/30 VUs  4m47.5s/6m00.0s

running (4m52.0s), 30/30 VUs, 11019 complete and 0 interrupted iterations
mixed_traffic   [  80% ] 30/30 VUs  4m48.5s/6m00.0s

running (4m53.0s), 30/30 VUs, 11071 complete and 0 interrupted iterations
mixed_traffic   [  80% ] 30/30 VUs  4m49.5s/6m00.0s

running (4m54.0s), 30/30 VUs, 11096 complete and 0 interrupted iterations
mixed_traffic   [  81% ] 30/30 VUs  4m50.5s/6m00.0s

running (4m55.0s), 30/30 VUs, 11106 complete and 0 interrupted iterations
mixed_traffic   [  81% ] 30/30 VUs  4m51.5s/6m00.0s

running (4m56.0s), 30/30 VUs, 11121 complete and 0 interrupted iterations
mixed_traffic   [  81% ] 30/30 VUs  4m52.5s/6m00.0s

running (4m57.0s), 30/30 VUs, 11135 complete and 0 interrupted iterations
mixed_traffic   [  82% ] 30/30 VUs  4m53.5s/6m00.0s

running (4m58.0s), 30/30 VUs, 11152 complete and 0 interrupted iterations
mixed_traffic   [  82% ] 30/30 VUs  4m54.5s/6m00.0s

running (4m59.0s), 30/30 VUs, 11190 complete and 0 interrupted iterations
mixed_traffic   [  82% ] 30/30 VUs  4m55.5s/6m00.0s

running (5m00.0s), 30/30 VUs, 11232 complete and 0 interrupted iterations
mixed_traffic   [  82% ] 30/30 VUs  4m56.5s/6m00.0s

running (5m01.0s), 30/30 VUs, 11276 complete and 0 interrupted iterations
mixed_traffic   [  83% ] 30/30 VUs  4m57.5s/6m00.0s

running (5m02.0s), 30/30 VUs, 11318 complete and 0 interrupted iterations
mixed_traffic   [  83% ] 30/30 VUs  4m58.5s/6m00.0s

running (5m03.0s), 30/30 VUs, 11362 complete and 0 interrupted iterations
mixed_traffic   [  83% ] 30/30 VUs  4m59.5s/6m00.0s

running (5m04.0s), 30/30 VUs, 11415 complete and 0 interrupted iterations
mixed_traffic   [  83% ] 30/30 VUs  5m00.5s/6m00.0s

running (5m05.0s), 30/30 VUs, 11468 complete and 0 interrupted iterations
mixed_traffic   [  84% ] 30/30 VUs  5m01.5s/6m00.0s

running (5m06.0s), 29/30 VUs, 11541 complete and 0 interrupted iterations
mixed_traffic   [  84% ] 29/30 VUs  5m02.5s/6m00.0s

running (5m07.0s), 29/30 VUs, 11598 complete and 0 interrupted iterations
mixed_traffic   [  84% ] 29/30 VUs  5m03.5s/6m00.0s

running (5m08.0s), 28/30 VUs, 11648 complete and 0 interrupted iterations
mixed_traffic   [  85% ] 28/30 VUs  5m04.5s/6m00.0s

running (5m09.0s), 28/30 VUs, 11694 complete and 0 interrupted iterations
mixed_traffic   [  85% ] 28/30 VUs  5m05.5s/6m00.0s

running (5m10.0s), 27/30 VUs, 11719 complete and 0 interrupted iterations
mixed_traffic   [  85% ] 27/30 VUs  5m06.5s/6m00.0s

running (5m11.0s), 27/30 VUs, 11731 complete and 0 interrupted iterations
mixed_traffic   [  85% ] 27/30 VUs  5m07.5s/6m00.0s

running (5m12.0s), 27/30 VUs, 11743 complete and 0 interrupted iterations
mixed_traffic   [  86% ] 27/30 VUs  5m08.5s/6m00.0s

running (5m13.0s), 26/30 VUs, 11767 complete and 0 interrupted iterations
mixed_traffic   [  86% ] 26/30 VUs  5m09.5s/6m00.0s

running (5m14.0s), 25/30 VUs, 11795 complete and 0 interrupted iterations
mixed_traffic   [  86% ] 25/30 VUs  5m10.5s/6m00.0s

running (5m15.0s), 25/30 VUs, 11820 complete and 0 interrupted iterations
mixed_traffic   [  87% ] 25/30 VUs  5m11.5s/6m00.0s

running (5m16.0s), 25/30 VUs, 11853 complete and 0 interrupted iterations
mixed_traffic   [  87% ] 25/30 VUs  5m12.5s/6m00.0s

running (5m17.0s), 24/30 VUs, 11891 complete and 0 interrupted iterations
mixed_traffic   [  87% ] 24/30 VUs  5m13.5s/6m00.0s

running (5m18.0s), 23/30 VUs, 11941 complete and 0 interrupted iterations
mixed_traffic   [  87% ] 23/30 VUs  5m14.5s/6m00.0s

running (5m19.0s), 23/30 VUs, 11988 complete and 0 interrupted iterations
mixed_traffic   [  88% ] 23/30 VUs  5m15.5s/6m00.0s

running (5m20.0s), 22/30 VUs, 12032 complete and 0 interrupted iterations
mixed_traffic   [  88% ] 22/30 VUs  5m16.5s/6m00.0s

running (5m21.0s), 22/30 VUs, 12079 complete and 0 interrupted iterations
mixed_traffic   [  88% ] 22/30 VUs  5m17.5s/6m00.0s

running (5m22.0s), 21/30 VUs, 12130 complete and 0 interrupted iterations
mixed_traffic   [  88% ] 21/30 VUs  5m18.5s/6m00.0s

running (5m23.0s), 21/30 VUs, 12167 complete and 0 interrupted iterations
mixed_traffic   [  89% ] 21/30 VUs  5m19.5s/6m00.0s

running (5m24.0s), 21/30 VUs, 12198 complete and 0 interrupted iterations
mixed_traffic   [  89% ] 21/30 VUs  5m20.5s/6m00.0s

running (5m25.0s), 20/30 VUs, 12229 complete and 0 interrupted iterations
mixed_traffic   [  89% ] 20/30 VUs  5m21.5s/6m00.0s

running (5m26.0s), 19/30 VUs, 12238 complete and 0 interrupted iterations
mixed_traffic   [  90% ] 19/30 VUs  5m22.5s/6m00.0s

running (5m27.0s), 19/30 VUs, 12244 complete and 0 interrupted iterations
mixed_traffic   [  90% ] 19/30 VUs  5m23.5s/6m00.0s

running (5m28.0s), 19/30 VUs, 12252 complete and 0 interrupted iterations
mixed_traffic   [  90% ] 19/30 VUs  5m24.5s/6m00.0s

running (5m29.0s), 19/30 VUs, 12265 complete and 0 interrupted iterations
mixed_traffic   [  90% ] 19/30 VUs  5m25.5s/6m00.0s

running (5m30.0s), 19/30 VUs, 12272 complete and 0 interrupted iterations
mixed_traffic   [  91% ] 19/30 VUs  5m26.5s/6m00.0s

running (5m31.0s), 19/30 VUs, 12276 complete and 0 interrupted iterations
mixed_traffic   [  91% ] 19/30 VUs  5m27.5s/6m00.0s

running (5m32.0s), 18/30 VUs, 12283 complete and 0 interrupted iterations
mixed_traffic   [  91% ] 18/30 VUs  5m28.5s/6m00.0s

running (5m33.0s), 17/30 VUs, 12294 complete and 0 interrupted iterations
mixed_traffic   [  92% ] 17/30 VUs  5m29.5s/6m00.0s

running (5m34.0s), 17/30 VUs, 12309 complete and 0 interrupted iterations
mixed_traffic   [  92% ] 17/30 VUs  5m30.5s/6m00.0s

running (5m35.0s), 17/30 VUs, 12326 complete and 0 interrupted iterations
mixed_traffic   [  92% ] 17/30 VUs  5m31.5s/6m00.0s

running (5m36.0s), 15/30 VUs, 12353 complete and 0 interrupted iterations
mixed_traffic   [  92% ] 15/30 VUs  5m32.5s/6m00.0s

running (5m37.0s), 14/30 VUs, 12379 complete and 0 interrupted iterations
mixed_traffic   [  93% ] 14/30 VUs  5m33.5s/6m00.0s

running (5m38.0s), 13/30 VUs, 12406 complete and 0 interrupted iterations
mixed_traffic   [  93% ] 13/30 VUs  5m34.5s/6m00.0s

running (5m39.0s), 13/30 VUs, 12429 complete and 0 interrupted iterations
mixed_traffic   [  93% ] 13/30 VUs  5m35.5s/6m00.0s

running (5m40.0s), 12/30 VUs, 12459 complete and 0 interrupted iterations
mixed_traffic   [  93% ] 12/30 VUs  5m36.5s/6m00.0s

running (5m41.0s), 12/30 VUs, 12489 complete and 0 interrupted iterations
mixed_traffic   [  94% ] 12/30 VUs  5m37.5s/6m00.0s

running (5m42.0s), 11/30 VUs, 12511 complete and 0 interrupted iterations
mixed_traffic   [  94% ] 11/30 VUs  5m38.5s/6m00.0s

running (5m43.0s), 11/30 VUs, 12529 complete and 0 interrupted iterations
mixed_traffic   [  94% ] 11/30 VUs  5m39.5s/6m00.0s

running (5m44.0s), 10/30 VUs, 12538 complete and 0 interrupted iterations
mixed_traffic   [  95% ] 10/30 VUs  5m40.5s/6m00.0s

running (5m45.0s), 10/30 VUs, 12553 complete and 0 interrupted iterations
mixed_traffic   [  95% ] 10/30 VUs  5m41.5s/6m00.0s

running (5m46.0s), 10/30 VUs, 12557 complete and 0 interrupted iterations
mixed_traffic   [  95% ] 10/30 VUs  5m42.5s/6m00.0s

running (5m47.0s), 09/30 VUs, 12563 complete and 0 interrupted iterations
mixed_traffic   [  95% ] 09/30 VUs  5m43.5s/6m00.0s

running (5m48.0s), 09/30 VUs, 12569 complete and 0 interrupted iterations
mixed_traffic   [  96% ] 09/30 VUs  5m44.5s/6m00.0s

running (5m49.0s), 08/30 VUs, 12576 complete and 0 interrupted iterations
mixed_traffic   [  96% ] 08/30 VUs  5m45.5s/6m00.0s

running (5m50.0s), 08/30 VUs, 12582 complete and 0 interrupted iterations
mixed_traffic   [  96% ] 08/30 VUs  5m46.5s/6m00.0s

running (5m51.0s), 07/30 VUs, 12589 complete and 0 interrupted iterations
mixed_traffic   [  97% ] 07/30 VUs  5m47.5s/6m00.0s

running (5m52.0s), 07/30 VUs, 12596 complete and 0 interrupted iterations
mixed_traffic   [  97% ] 07/30 VUs  5m48.5s/6m00.0s

running (5m53.0s), 06/30 VUs, 12603 complete and 0 interrupted iterations
mixed_traffic   [  97% ] 06/30 VUs  5m49.5s/6m00.0s

running (5m54.0s), 05/30 VUs, 12607 complete and 0 interrupted iterations
mixed_traffic   [  97% ] 05/30 VUs  5m50.5s/6m00.0s

running (5m55.0s), 05/30 VUs, 12616 complete and 0 interrupted iterations
mixed_traffic   [  98% ] 05/30 VUs  5m51.5s/6m00.0s

running (5m56.0s), 05/30 VUs, 12623 complete and 0 interrupted iterations
mixed_traffic   [  98% ] 05/30 VUs  5m52.5s/6m00.0s

running (5m57.0s), 04/30 VUs, 12631 complete and 0 interrupted iterations
mixed_traffic   [  98% ] 04/30 VUs  5m53.5s/6m00.0s

running (5m58.0s), 03/30 VUs, 12635 complete and 0 interrupted iterations
mixed_traffic   [  98% ] 03/30 VUs  5m54.5s/6m00.0s

running (5m59.0s), 03/30 VUs, 12638 complete and 0 interrupted iterations
mixed_traffic   [  99% ] 03/30 VUs  5m55.5s/6m00.0s

running (6m00.0s), 02/30 VUs, 12643 complete and 0 interrupted iterations
mixed_traffic   [  99% ] 02/30 VUs  5m56.5s/6m00.0s

running (6m01.0s), 02/30 VUs, 12646 complete and 0 interrupted iterations
mixed_traffic   [  99% ] 02/30 VUs  5m57.5s/6m00.0s

running (6m02.0s), 02/30 VUs, 12649 complete and 0 interrupted iterations
mixed_traffic   [ 100% ] 02/30 VUs  5m58.5s/6m00.0s

running (6m03.0s), 01/30 VUs, 12651 complete and 0 interrupted iterations
mixed_traffic   [ 100% ] 01/30 VUs  5m59.5s/6m00.0s


  █ THRESHOLDS 

    flow_browse_duration
    ✓ 'p(95)<800' p(95)=9ms

    flow_order_journey_duration
    ✗ 'p(95)<3000' p(95)=7.92s

    unexpected_errors
    ✓ 'rate<0.02' rate=0.21%


  █ TOTAL RESULTS 

    checks_total.......: 21077  57.958007/s
    checks_succeeded...: 76.25% 16073 out of 21077
    checks_failed......: 23.74% 5004 out of 21077

    ✓ setup: admin login 200
    ✓ setup: product created 201
    ✓ setup: stock set 200
    ✓ browse: list 200
    ✓ browse: get by id 200
    ✗ order_journey: signup 201
      ↳  9% — ✓ 354 / ✗ 3372
    ✗ order_journey: login 200
      ↳  39% — ✓ 140 / ✗ 214
    ✓ order_journey: place order 201
    ✓ order_journey: get order 200
    ✓ order_journey: list my orders 200
    ✓ order_journey: cancel 204 or 409
    ✗ repeat_login: login 200
      ↳  26% — ✓ 522 / ✗ 1418
    ✓ repeat_login: list orders 200
    ✓ admin_ops: list all orders 200
    ✓ admin_ops: notification log 200

    CUSTOM
    flow_admin_ops_duration........: avg=15.73ms  min=11ms     med=15ms     p(90)=18ms     p(95)=20ms     p(99)=26ms  max=40ms 
    flow_browse_duration...........: avg=6.33ms   min=4ms      med=6ms      p(90)=8ms      p(95)=9ms      p(99)=12ms  max=40ms 
    flow_order_journey_duration....: avg=3.82s    min=656ms    med=3.13s    p(90)=7.44s    p(95)=7.92s    p(99)=8.53s max=8.74s
    flow_repeat_login_duration.....: avg=2.3s     min=311ms    med=1.97s    p(90)=4.78s    p(95)=5.36s    p(99)=7.27s max=9.96s
    orders_created.................: 140    0.384975/s
    unexpected_errors..............: 0.21%  45 out of 21074

    HTTP
    http_req_duration..............: avg=157.92ms min=1.07ms   med=2.85ms   p(90)=11.22ms  p(95)=1.18s    p(99)=3.05s max=9.95s
      { expected_response:true }...: avg=135.45ms min=1.75ms   med=3.15ms   p(90)=11.51ms  p(95)=653.31ms p(99)=3.61s max=9.95s
    http_req_failed................: 23.73% 5004 out of 21087
    http_reqs......................: 21087  57.985505/s

    EXECUTION
    iteration_duration.............: avg=713.17ms min=202.47ms med=482.82ms p(90)=706.54ms p(95)=3.24s    p(99)=4.91s max=10.5s
    iterations.....................: 12652  34.790753/s
    vus............................: 1      min=0             max=30
    vus_max........................: 30     min=30            max=30

    NETWORK
    data_received..................: 50 MB  137 kB/s
    data_sent......................: 5.3 MB 15 kB/s



running (6m03.7s), 00/30 VUs, 12652 complete and 0 interrupted iterations
mixed_traffic ✓ [ 100% ] 00/30 VUs  6m0s
time="2026-07-23T14:41:33-05:00" level=error msg="thresholds on metrics 'flow_order_journey_duration' have been crossed"